sobczyk/bsp/csps/lpc32xx/bsps/fdi3250/startup/board/ARM9DIMM_LPC3250_pinConfig.h
/*---------------------------------------------------------------------------*
 *   This data created with PinsToH v1.00 - Copyright Future Designs, Inc.
 *---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
 * Port 0 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P0[0] ----- */
//#define PINCFG_P0_0                     0 // P0.0
  #define PINCFG_P0_0                     1 // I2S1RX_CLK
  #define PINSET_P0_0                     1
  #define PINCLR_P0_0                     0
  #define PINDIR_P0_0                     0 // Input
  #define PINMODE_P0_0                    2 // Floating

  /* ----- Pin P0[1] ----- */
//#define PINCFG_P0_1                     0 // P0.1
  #define PINCFG_P0_1                     1 // I2S1RX_WS
  #define PINSET_P0_1                     1
  #define PINCLR_P0_1                     0
  #define PINDIR_P0_1                     0 // Input
  #define PINMODE_P0_1                    2 // Floating

  /* ----- Pin P0[2] ----- */
  #define PINCFG_P0_2                     0 // P0.2
//#define PINCFG_P0_2                     1 // I2S0RX_SDA
  #define PINSET_P0_2                     1
  #define PINCLR_P0_2                     0
  #define PINDIR_P0_2                     0 // Input
  #define PINMODE_P0_2                    2 // Floating

  /* ----- Pin P0[3] ----- */
  #define PINCFG_P0_3                     0 // P0.3
//#define PINCFG_P0_3                     1 // I2S0RX_CLK
  #define PINSET_P0_3                     1
  #define PINCLR_P0_3                     0
  #define PINDIR_P0_3                     0 // Input
  #define PINMODE_P0_3                    2 // Floating

  /* ----- Pin P0[4] ----- */
  #define PINCFG_P0_4                     0 // P0.4
//#define PINCFG_P0_4                     1 // I2S0RX_WS
  #define PINSET_P0_4                     1
  #define PINCLR_P0_4                     0
  #define PINDIR_P0_4                     0 // Input
  #define PINMODE_P0_4                    2 // Floating

  /* ----- Pin P0[5] ----- */
  #define PINCFG_P0_5                     0 // P0.5
//#define PINCFG_P0_5                     1 // I2S0TX_SDA
  #define PINSET_P0_5                     1
  #define PINCLR_P0_5                     0
  #define PINDIR_P0_5                     0 // Input
  #define PINMODE_P0_5                    2 // Floating

  /* ----- Pin P0[6] ----- */
  #define PINCFG_P0_6                     0 // P0.6
//#define PINCFG_P0_6                     1 // I2S0TX_CLK
  #define PINSET_P0_6                     1
  #define PINCLR_P0_6                     0
  #define PINDIR_P0_6                     0 // Input
  #define PINMODE_P0_6                    2 // Floating

  /* ----- Pin P0[7] ----- */
  #define PINCFG_P0_7                     0 // P0.7
//#define PINCFG_P0_7                     1 // I2S0TX_WS
  #define PINSET_P0_7                     1
  #define PINCLR_P0_7                     0
  #define PINDIR_P0_7                     0 // Input
  #define PINMODE_P0_7                    2 // Floating

  /* ----- Pin P0[8] ----- */
  #define PINCFG_P0_8                     0 // Reserved
//#define PINCFG_P0_8                     1 // Reserved
  #define PINSET_P0_8                     1
  #define PINCLR_P0_8                     0
  #define PINDIR_P0_8                     0 // Input
  #define PINMODE_P0_8                    2 // Floating

  /* ----- Pin P0[9] ----- */
  #define PINCFG_P0_9                     0 // Reserved
//#define PINCFG_P0_9                     1 // Reserved
  #define PINSET_P0_9                     1
  #define PINCLR_P0_9                     0
  #define PINDIR_P0_9                     0 // Input
  #define PINMODE_P0_9                    2 // Floating

  /* ----- Pin P0[10] ----- */
  #define PINCFG_P0_10                    0 // Reserved
//#define PINCFG_P0_10                    1 // Reserved
  #define PINSET_P0_10                    1
  #define PINCLR_P0_10                    0
  #define PINDIR_P0_10                    0 // Input
  #define PINMODE_P0_10                   2 // Floating

  /* ----- Pin P0[11] ----- */
  #define PINCFG_P0_11                    0 // Reserved
//#define PINCFG_P0_11                    1 // Reserved
  #define PINSET_P0_11                    1
  #define PINCLR_P0_11                    0
  #define PINDIR_P0_11                    0 // Input
  #define PINMODE_P0_11                   2 // Floating

  /* ----- Pin P0[12] ----- */
  #define PINCFG_P0_12                    0 // Reserved
//#define PINCFG_P0_12                    1 // Reserved
  #define PINSET_P0_12                    1
  #define PINCLR_P0_12                    0
  #define PINDIR_P0_12                    0 // Input
  #define PINMODE_P0_12                   2 // Floating

  /* ----- Pin P0[13] ----- */
  #define PINCFG_P0_13                    0 // Reserved
//#define PINCFG_P0_13                    1 // Reserved
  #define PINSET_P0_13                    1
  #define PINCLR_P0_13                    0
  #define PINDIR_P0_13                    0 // Input
  #define PINMODE_P0_13                   2 // Floating

  /* ----- Pin P0[14] ----- */
  #define PINCFG_P0_14                    0 // Reserved
//#define PINCFG_P0_14                    1 // Reserved
  #define PINSET_P0_14                    1
  #define PINCLR_P0_14                    0
  #define PINDIR_P0_14                    0 // Input
  #define PINMODE_P0_14                   2 // Floating

  /* ----- Pin P0[15] ----- */
  #define PINCFG_P0_15                    0 // Reserved
//#define PINCFG_P0_15                    1 // Reserved
  #define PINSET_P0_15                    1
  #define PINCLR_P0_15                    0
  #define PINDIR_P0_15                    0 // Input
  #define PINMODE_P0_15                   2 // Floating

  /* ----- Pin P0[16] ----- */
  #define PINCFG_P0_16                    0 // Reserved
//#define PINCFG_P0_16                    1 // Reserved
  #define PINSET_P0_16                    1
  #define PINCLR_P0_16                    0
  #define PINDIR_P0_16                    0 // Input
  #define PINMODE_P0_16                   2 // Floating

