sobczyk/bsp/csps/lpc32xx/bsps/fdi3250/startup/board/ARM9DIMM_LPC3250_pinConfig.h
  /* ----- Pin P0[17] ----- */
  #define PINCFG_P0_17                    0 // Reserved
//#define PINCFG_P0_17                    1 // Reserved
  #define PINSET_P0_17                    1
  #define PINCLR_P0_17                    0
  #define PINDIR_P0_17                    0 // Input
  #define PINMODE_P0_17                   2 // Floating

  /* ----- Pin P0[18] ----- */
  #define PINCFG_P0_18                    0 // Reserved
//#define PINCFG_P0_18                    1 // Reserved
  #define PINSET_P0_18                    1
  #define PINCLR_P0_18                    0
  #define PINDIR_P0_18                    0 // Input
  #define PINMODE_P0_18                   2 // Floating

  /* ----- Pin P0[19] ----- */
  #define PINCFG_P0_19                    0 // Reserved
//#define PINCFG_P0_19                    1 // Reserved
  #define PINSET_P0_19                    1
  #define PINCLR_P0_19                    0
  #define PINDIR_P0_19                    0 // Input
  #define PINMODE_P0_19                   2 // Floating

  /* ----- Pin P0[20] ----- */
  #define PINCFG_P0_20                    0 // Reserved
//#define PINCFG_P0_20                    1 // Reserved
  #define PINSET_P0_20                    1
  #define PINCLR_P0_20                    0
  #define PINDIR_P0_20                    0 // Input
  #define PINMODE_P0_20                   2 // Floating

  /* ----- Pin P0[21] ----- */
  #define PINCFG_P0_21                    0 // Reserved
//#define PINCFG_P0_21                    1 // Reserved
  #define PINSET_P0_21                    1
  #define PINCLR_P0_21                    0
  #define PINDIR_P0_21                    0 // Input
  #define PINMODE_P0_21                   2 // Floating

  /* ----- Pin P0[22] ----- */
  #define PINCFG_P0_22                    0 // Reserved
//#define PINCFG_P0_22                    1 // Reserved
  #define PINSET_P0_22                    1
  #define PINCLR_P0_22                    0
  #define PINDIR_P0_22                    0 // Input
  #define PINMODE_P0_22                   2 // Floating

  /* ----- Pin P0[23] ----- */
  #define PINCFG_P0_23                    0 // Reserved
//#define PINCFG_P0_23                    1 // Reserved
  #define PINSET_P0_23                    1
  #define PINCLR_P0_23                    0
  #define PINDIR_P0_23                    0 // Input
  #define PINMODE_P0_23                   2 // Floating

  /* ----- Pin P0[24] ----- */
  #define PINCFG_P0_24                    0 // Reserved
//#define PINCFG_P0_24                    1 // Reserved
  #define PINSET_P0_24                    1
  #define PINCLR_P0_24                    0
  #define PINDIR_P0_24                    0 // Input
  #define PINMODE_P0_24                   2 // Floating

  /* ----- Pin P0[25] ----- */
  #define PINCFG_P0_25                    0 // Reserved
//#define PINCFG_P0_25                    1 // Reserved
  #define PINSET_P0_25                    1
  #define PINCLR_P0_25                    0
  #define PINDIR_P0_25                    0 // Input
  #define PINMODE_P0_25                   2 // Floating

  /* ----- Pin P0[26] ----- */
  #define PINCFG_P0_26                    0 // Reserved
//#define PINCFG_P0_26                    1 // Reserved
  #define PINSET_P0_26                    1
  #define PINCLR_P0_26                    0
  #define PINDIR_P0_26                    0 // Input
  #define PINMODE_P0_26                   2 // Floating

  /* ----- Pin P0[27] ----- */
  #define PINCFG_P0_27                    0 // Reserved
//#define PINCFG_P0_27                    1 // Reserved
  #define PINSET_P0_27                    1
  #define PINCLR_P0_27                    0
  #define PINDIR_P0_27                    0 // Input
  #define PINMODE_P0_27                   2 // Floating

  /* ----- Pin P0[28] ----- */
  #define PINCFG_P0_28                    0 // Reserved
//#define PINCFG_P0_28                    1 // Reserved
  #define PINSET_P0_28                    1
  #define PINCLR_P0_28                    0
  #define PINDIR_P0_28                    0 // Input
  #define PINMODE_P0_28                   2 // Floating

  /* ----- Pin P0[29] ----- */
  #define PINCFG_P0_29                    0 // Reserved
//#define PINCFG_P0_29                    1 // Reserved
  #define PINSET_P0_29                    1
  #define PINCLR_P0_29                    0
  #define PINDIR_P0_29                    0 // Input
  #define PINMODE_P0_29                   2 // Floating

  /* ----- Pin P0[30] ----- */
  #define PINCFG_P0_30                    0 // Reserved
//#define PINCFG_P0_30                    1 // Reserved
  #define PINSET_P0_30                    1
  #define PINCLR_P0_30                    0
  #define PINDIR_P0_30                    0 // Input
  #define PINMODE_P0_30                   2 // Floating

  /* ----- Pin P0[31] ----- */
  #define PINCFG_P0_31                    0 // Reserved
//#define PINCFG_P0_31                    1 // Reserved
  #define PINSET_P0_31                    1
  #define PINCLR_P0_31                    0
  #define PINDIR_P0_31                    0 // Input
  #define PINMODE_P0_31                   2 // Floating

/*---------------------------------------------------------------------------*
 * Port 1 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P1[0] ----- */
  #define PINCFG_P1_0                     0 // EMC_A[0]
//#define PINCFG_P1_0                     1 // P1.0
  #define PINSET_P1_0                     1
  #define PINCLR_P1_0                     0
  #define PINDIR_P1_0                     0 // Input
  #define PINMODE_P1_0                    2 // Floating

  /* ----- Pin P1[1] ----- */
  #define PINCFG_P1_1                     0 // EMC_A[1]
//#define PINCFG_P1_1                     1 // P1.1
  #define PINSET_P1_1                     1
  #define PINCLR_P1_1                     0
  #define PINDIR_P1_1                     0 // Input
  #define PINMODE_P1_1                    2 // Floating

  /* ----- Pin P1[2] ----- */
  #define PINCFG_P1_2                     0 // EMC_A[2]
//#define PINCFG_P1_2                     1 // P1.2
  #define PINSET_P1_2                     1
  #define PINCLR_P1_2                     0
  #define PINDIR_P1_2                     0 // Input
  #define PINMODE_P1_2                    2 // Floating

  /* ----- Pin P1[3] ----- */
  #define PINCFG_P1_3                     0 // EMC_A[3]
//#define PINCFG_P1_3                     1 // P1.3
  #define PINSET_P1_3                     1
  #define PINCLR_P1_3                     0
  #define PINDIR_P1_3                     0 // Input
  #define PINMODE_P1_3                    2 // Floating

  /* ----- Pin P1[4] ----- */
  #define PINCFG_P1_4                     0 // EMC_A[4]
//#define PINCFG_P1_4                     1 // P1.4
  #define PINSET_P1_4                     1
  #define PINCLR_P1_4                     0
  #define PINDIR_P1_4                     0 // Input
  #define PINMODE_P1_4                    2 // Floating

  /* ----- Pin P1[5] ----- */
  #define PINCFG_P1_5                     0 // EMC_A[5]
//#define PINCFG_P1_5                     1 // P1.5
  #define PINSET_P1_5                     1
  #define PINCLR_P1_5                     0
  #define PINDIR_P1_5                     0 // Input
  #define PINMODE_P1_5                    2 // Floating

