sobczyk/bsp/csps/lpc32xx/bsps/fdi3250/startup/board/ARM9DIMM_LPC3250_pinConfig.h
  /* ----- Pin P1[6] ----- */
  #define PINCFG_P1_6                     0 // EMC_A[6]
//#define PINCFG_P1_6                     1 // P1.6
  #define PINSET_P1_6                     1
  #define PINCLR_P1_6                     0
  #define PINDIR_P1_6                     0 // Input
  #define PINMODE_P1_6                    2 // Floating

  /* ----- Pin P1[7] ----- */
  #define PINCFG_P1_7                     0 // EMC_A[7]
//#define PINCFG_P1_7                     1 // P1.7
  #define PINSET_P1_7                     1
  #define PINCLR_P1_7                     0
  #define PINDIR_P1_7                     0 // Input
  #define PINMODE_P1_7                    2 // Floating

  /* ----- Pin P1[8] ----- */
  #define PINCFG_P1_8                     0 // EMC_A[8]
//#define PINCFG_P1_8                     1 // P1.8
  #define PINSET_P1_8                     1
  #define PINCLR_P1_8                     0
  #define PINDIR_P1_8                     0 // Input
  #define PINMODE_P1_8                    2 // Floating

  /* ----- Pin P1[9] ----- */
  #define PINCFG_P1_9                     0 // EMC_A[9]
//#define PINCFG_P1_9                     1 // P1.9
  #define PINSET_P1_9                     1
  #define PINCLR_P1_9                     0
  #define PINDIR_P1_9                     0 // Input
  #define PINMODE_P1_9                    2 // Floating

  /* ----- Pin P1[10] ----- */
  #define PINCFG_P1_10                    0 // EMC_A[10]
//#define PINCFG_P1_10                    1 // P1.10
  #define PINSET_P1_10                    1
  #define PINCLR_P1_10                    0
  #define PINDIR_P1_10                    0 // Input
  #define PINMODE_P1_10                   2 // Floating

  /* ----- Pin P1[11] ----- */
  #define PINCFG_P1_11                    0 // EMC_A[11]
//#define PINCFG_P1_11                    1 // P1.11
  #define PINSET_P1_11                    1
  #define PINCLR_P1_11                    0
  #define PINDIR_P1_11                    0 // Input
  #define PINMODE_P1_11                   2 // Floating

  /* ----- Pin P1[12] ----- */
  #define PINCFG_P1_12                    0 // EMC_A[12]
//#define PINCFG_P1_12                    1 // P1.12
  #define PINSET_P1_12                    1
  #define PINCLR_P1_12                    0
  #define PINDIR_P1_12                    0 // Input
  #define PINMODE_P1_12                   2 // Floating

  /* ----- Pin P1[13] ----- */
  #define PINCFG_P1_13                    0 // EMC_A[13]
//#define PINCFG_P1_13                    1 // P1.13
  #define PINSET_P1_13                    1
  #define PINCLR_P1_13                    0
  #define PINDIR_P1_13                    0 // Input
  #define PINMODE_P1_13                   2 // Floating

  /* ----- Pin P1[14] ----- */
  #define PINCFG_P1_14                    0 // EMC_A[14]
//#define PINCFG_P1_14                    1 // P1.14
  #define PINSET_P1_14                    1
  #define PINCLR_P1_14                    0
  #define PINDIR_P1_14                    0 // Input
  #define PINMODE_P1_14                   2 // Floating

  /* ----- Pin P1[15] ----- */
//#define PINCFG_P1_15                    0 // EMC_A[15]
  #define PINCFG_P1_15                    1 // P1.15
  #define PINSET_P1_15                    1
  #define PINCLR_P1_15                    0
  #define PINDIR_P1_15                    0 // Input
  #define PINMODE_P1_15                   2 // Floating

  /* ----- Pin P1[16] ----- */
//#define PINCFG_P1_16                    0 // EMC_A[16]
  #define PINCFG_P1_16                    1 // P1.16
  #define PINSET_P1_16                    1
  #define PINCLR_P1_16                    0
  #define PINDIR_P1_16                    0 // Input
  #define PINMODE_P1_16                   2 // Floating

  /* ----- Pin P1[17] ----- */
//#define PINCFG_P1_17                    0 // EMC_A[17]
  #define PINCFG_P1_17                    1 // P1.17
  #define PINSET_P1_17                    1
  #define PINCLR_P1_17                    0
  #define PINDIR_P1_17                    0 // Input
  #define PINMODE_P1_17                   2 // Floating

  /* ----- Pin P1[18] ----- */
//#define PINCFG_P1_18                    0 // EMC_A[18]
  #define PINCFG_P1_18                    1 // P1.18
  #define PINSET_P1_18                    1
  #define PINCLR_P1_18                    0
  #define PINDIR_P1_18                    0 // Input
  #define PINMODE_P1_18                   2 // Floating

  /* ----- Pin P1[19] ----- */
//#define PINCFG_P1_19                    0 // EMC_A[19]
  #define PINCFG_P1_19                    1 // P1.19
  #define PINSET_P1_19                    1
  #define PINCLR_P1_19                    0
  #define PINDIR_P1_19                    0 // Input
  #define PINMODE_P1_19                   2 // Floating

  /* ----- Pin P1[20] ----- */
//#define PINCFG_P1_20                    0 // EMC_A[20]
  #define PINCFG_P1_20                    1 // P1.20
  #define PINSET_P1_20                    1
  #define PINCLR_P1_20                    0
  #define PINDIR_P1_20                    0 // Input
  #define PINMODE_P1_20                   2 // Floating

  /* ----- Pin P1[21] ----- */
//#define PINCFG_P1_21                    0 // EMC_A[21]
  #define PINCFG_P1_21                    1 // P1.21
  #define PINSET_P1_21                    1
  #define PINCLR_P1_21                    0
  #define PINDIR_P1_21                    0 // Input
  #define PINMODE_P1_21                   2 // Floating

  /* ----- Pin P1[22] ----- */
//#define PINCFG_P1_22                    0 // EMC_A[22]
  #define PINCFG_P1_22                    1 // P1.22
  #define PINSET_P1_22                    1
  #define PINCLR_P1_22                    0
  #define PINDIR_P1_22                    0 // Input
  #define PINMODE_P1_22                   2 // Floating

  /* ----- Pin P1[23] ----- */
//#define PINCFG_P1_23                    0 // EMC_A[23]
  #define PINCFG_P1_23                    1 // P1.23
  #define PINSET_P1_23                    1
  #define PINCLR_P1_23                    0
  #define PINDIR_P1_23                    0 // Input
  #define PINMODE_P1_23                   2 // Floating

  /* ----- Pin P1[24] ----- */
  #define PINCFG_P1_24                    0 // Reserved
//#define PINCFG_P1_24                    1 // Reserved
  #define PINSET_P1_24                    1
  #define PINCLR_P1_24                    0
  #define PINDIR_P1_24                    0 // Input
  #define PINMODE_P1_24                   2 // Floating

  /* ----- Pin P1[25] ----- */
  #define PINCFG_P1_25                    0 // Reserved
//#define PINCFG_P1_25                    1 // Reserved
  #define PINSET_P1_25                    1
  #define PINCLR_P1_25                    0
  #define PINDIR_P1_25                    0 // Input
  #define PINMODE_P1_25                   2 // Floating

  /* ----- Pin P1[26] ----- */
  #define PINCFG_P1_26                    0 // Reserved
//#define PINCFG_P1_26                    1 // Reserved
  #define PINSET_P1_26                    1
  #define PINCLR_P1_26                    0
  #define PINDIR_P1_26                    0 // Input
  #define PINMODE_P1_26                   2 // Floating

  /* ----- Pin P1[27] ----- */
  #define PINCFG_P1_27                    0 // Reserved
//#define PINCFG_P1_27                    1 // Reserved
  #define PINSET_P1_27                    1
  #define PINCLR_P1_27                    0
  #define PINDIR_P1_27                    0 // Input
  #define PINMODE_P1_27                   2 // Floating

