sobczyk/bsp/csps/lpc32xx/bsps/fdi3250/startup/board/ARM9DIMM_LPC3250_pinConfig.h
  /* ----- Pin P1[28] ----- */
  #define PINCFG_P1_28                    0 // Reserved
//#define PINCFG_P1_28                    1 // Reserved
  #define PINSET_P1_28                    1
  #define PINCLR_P1_28                    0
  #define PINDIR_P1_28                    0 // Input
  #define PINMODE_P1_28                   2 // Floating

  /* ----- Pin P1[29] ----- */
  #define PINCFG_P1_29                    0 // Reserved
//#define PINCFG_P1_29                    1 // Reserved
  #define PINSET_P1_29                    1
  #define PINCLR_P1_29                    0
  #define PINDIR_P1_29                    0 // Input
  #define PINMODE_P1_29                   2 // Floating

  /* ----- Pin P1[30] ----- */
  #define PINCFG_P1_30                    0 // Reserved
//#define PINCFG_P1_30                    1 // Reserved
  #define PINSET_P1_30                    1
  #define PINCLR_P1_30                    0
  #define PINDIR_P1_30                    0 // Input
  #define PINMODE_P1_30                   2 // Floating

  /* ----- Pin P1[31] ----- */
  #define PINCFG_P1_31                    0 // Reserved
//#define PINCFG_P1_31                    1 // Reserved
  #define PINSET_P1_31                    1
  #define PINCLR_P1_31                    0
  #define PINDIR_P1_31                    0 // Input
  #define PINMODE_P1_31                   2 // Floating

/*---------------------------------------------------------------------------*
 * Port 2 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P2[0] ----- */
  #define PINCFG_P2_0                     0 // GPIO_02
//#define PINCFG_P2_0                     1 // KEY_ROW6
  #define PINSET_P2_0                     1
  #define PINCLR_P2_0                     0
  #define PINDIR_P2_0                     0 // Input
  #define PINMODE_P2_0                    2 // Floating

  /* ----- Pin P2[1] ----- */
  #define PINCFG_P2_1                     0 // GPIO_03
//#define PINCFG_P2_1                     1 // KEY_ROW7
  #define PINSET_P2_1                     1
  #define PINCLR_P2_1                     0
  #define PINDIR_P2_1                     0 // Input
  #define PINMODE_P2_1                    2 // Floating

  /* ----- Pin P2[2] ----- */
  #define PINCFG_P2_2                     0 // GPO_21
//#define PINCFG_P2_2                     1 // U4_TX
  #define PINSET_P2_2                     1
  #define PINCLR_P2_2                     0
  #define PINDIR_P2_2                     0 // Input
  #define PINMODE_P2_2                    2 // Floating

  /* ----- Pin P2[3] ----- */
//#define PINCFG_P2_3                     0 // EMC_D_SEL
  #define PINCFG_P2_3                     1 // GPIO_Block
  #define PINSET_P2_3                     1
  #define PINCLR_P2_3                     0
  #define PINDIR_P2_3                     0 // Input
  #define PINMODE_P2_3                    2 // Floating

  /* ----- Pin P2[4] ----- */
  #define PINCFG_P2_4                     0 // GPIO_04
//#define PINCFG_P2_4                     1 // SSEL1
  #define PINSET_P2_4                     1
  #define PINCLR_P2_4                     0
  #define PINDIR_P2_4                     0 // Input
  #define PINMODE_P2_4                    2 // Floating

  /* ----- Pin P2[5] ----- */
  #define PINCFG_P2_5                     0 // GPIO_05
//#define PINCFG_P2_5                     1 // SSEL0 / MCFB0 if TIMCLK_CTRL1[6]=1
  #define PINSET_P2_5                     1
  #define PINCLR_P2_5                     0
  #define PINDIR_P2_5                     1 // Output
  #define PINMODE_P2_5                    2 // Floating

  /* ----- Pin P2[6] ----- */
  #define PINCFG_P2_6                     0 // Reserved
//#define PINCFG_P2_6                     1 // Reserved
  #define PINSET_P2_6                     1
  #define PINCLR_P2_6                     0
  #define PINDIR_P2_6                     0 // Input
  #define PINMODE_P2_6                    2 // Floating

  /* ----- Pin P2[7] ----- */
  #define PINCFG_P2_7                     0 // Reserved
//#define PINCFG_P2_7                     1 // Reserved
  #define PINSET_P2_7                     1
  #define PINCLR_P2_7                     0
  #define PINDIR_P2_7                     0 // Input
  #define PINMODE_P2_7                    2 // Floating

  /* ----- Pin P2[8] ----- */
  #define PINCFG_P2_8                     0 // Reserved
//#define PINCFG_P2_8                     1 // Reserved
  #define PINSET_P2_8                     1
  #define PINCLR_P2_8                     0
  #define PINDIR_P2_8                     0 // Input
  #define PINMODE_P2_8                    2 // Floating

  /* ----- Pin P2[9] ----- */
  #define PINCFG_P2_9                     0 // Reserved
//#define PINCFG_P2_9                     1 // Reserved
  #define PINSET_P2_9                     1
  #define PINCLR_P2_9                     0
  #define PINDIR_P2_9                     0 // Input
  #define PINMODE_P2_9                    2 // Floating

  /* ----- Pin P2[10] ----- */
  #define PINCFG_P2_10                    0 // Reserved
//#define PINCFG_P2_10                    1 // Reserved
  #define PINSET_P2_10                    1
  #define PINCLR_P2_10                    0
  #define PINDIR_P2_10                    0 // Input
  #define PINMODE_P2_10                   2 // Floating

  /* ----- Pin P2[11] ----- */
  #define PINCFG_P2_11                    0 // Reserved
//#define PINCFG_P2_11                    1 // Reserved
  #define PINSET_P2_11                    1
  #define PINCLR_P2_11                    0
  #define PINDIR_P2_11                    0 // Input
  #define PINMODE_P2_11                   2 // Floating

  /* ----- Pin P2[12] ----- */
  #define PINCFG_P2_12                    0 // Reserved
//#define PINCFG_P2_12                    1 // Reserved
  #define PINSET_P2_12                    1
  #define PINCLR_P2_12                    0
  #define PINDIR_P2_12                    0 // Input
  #define PINMODE_P2_12                   2 // Floating

  /* ----- Pin P2[13] ----- */
  #define PINCFG_P2_13                    0 // Reserved
//#define PINCFG_P2_13                    1 // Reserved
  #define PINSET_P2_13                    1
  #define PINCLR_P2_13                    0
  #define PINDIR_P2_13                    0 // Input
  #define PINMODE_P2_13                   2 // Floating

