sobczyk/bsp/csps/lpc32xx/bsps/fdi3250/startup/board/ARM9DIMM_LPC3250_pinConfig.h
  /* ----- Pin P2[14] ----- */
  #define PINCFG_P2_14                    0 // Reserved
//#define PINCFG_P2_14                    1 // Reserved
  #define PINSET_P2_14                    1
  #define PINCLR_P2_14                    0
  #define PINDIR_P2_14                    0 // Input
  #define PINMODE_P2_14                   2 // Floating

  /* ----- Pin P2[15] ----- */
  #define PINCFG_P2_15                    0 // Reserved
//#define PINCFG_P2_15                    1 // Reserved
  #define PINSET_P2_15                    1
  #define PINCLR_P2_15                    0
  #define PINDIR_P2_15                    0 // Input
  #define PINMODE_P2_15                   2 // Floating

  /* ----- Pin P2[16] ----- */
  #define PINCFG_P2_16                    0 // Reserved
//#define PINCFG_P2_16                    1 // Reserved
  #define PINSET_P2_16                    1
  #define PINCLR_P2_16                    0
  #define PINDIR_P2_16                    0 // Input
  #define PINMODE_P2_16                   2 // Floating

  /* ----- Pin P2[17] ----- */
  #define PINCFG_P2_17                    0 // Reserved
//#define PINCFG_P2_17                    1 // Reserved
  #define PINSET_P2_17                    1
  #define PINCLR_P2_17                    0
  #define PINDIR_P2_17                    0 // Input
  #define PINMODE_P2_17                   2 // Floating

  /* ----- Pin P2[18] ----- */
  #define PINCFG_P2_18                    0 // Reserved
//#define PINCFG_P2_18                    1 // Reserved
  #define PINSET_P2_18                    1
  #define PINCLR_P2_18                    0
  #define PINDIR_P2_18                    0 // Input
  #define PINMODE_P2_18                   2 // Floating

  /* ----- Pin P2[19] ----- */
  #define PINCFG_P2_19                    0 // Reserved
//#define PINCFG_P2_19                    1 // Reserved
  #define PINSET_P2_19                    1
  #define PINCLR_P2_19                    0
  #define PINDIR_P2_19                    0 // Input
  #define PINMODE_P2_19                   2 // Floating

  /* ----- Pin P2[20] ----- */
  #define PINCFG_P2_20                    0 // Reserved
//#define PINCFG_P2_20                    1 // Reserved
  #define PINSET_P2_20                    1
  #define PINCLR_P2_20                    0
  #define PINDIR_P2_20                    0 // Input
  #define PINMODE_P2_20                   2 // Floating

  /* ----- Pin P2[21] ----- */
  #define PINCFG_P2_21                    0 // Reserved
//#define PINCFG_P2_21                    1 // Reserved
  #define PINSET_P2_21                    1
  #define PINCLR_P2_21                    0
  #define PINDIR_P2_21                    0 // Input
  #define PINMODE_P2_21                   2 // Floating

  /* ----- Pin P2[22] ----- */
  #define PINCFG_P2_22                    0 // Reserved
//#define PINCFG_P2_22                    1 // Reserved
  #define PINSET_P2_22                    1
  #define PINCLR_P2_22                    0
  #define PINDIR_P2_22                    0 // Input
  #define PINMODE_P2_22                   2 // Floating

  /* ----- Pin P2[23] ----- */
  #define PINCFG_P2_23                    0 // Reserved
//#define PINCFG_P2_23                    1 // Reserved
  #define PINSET_P2_23                    1
  #define PINCLR_P2_23                    0
  #define PINDIR_P2_23                    0 // Input
  #define PINMODE_P2_23                   2 // Floating

  /* ----- Pin P2[24] ----- */
  #define PINCFG_P2_24                    0 // Reserved
//#define PINCFG_P2_24                    1 // Reserved
  #define PINSET_P2_24                    1
  #define PINCLR_P2_24                    0
  #define PINDIR_P2_24                    0 // Input
  #define PINMODE_P2_24                   2 // Floating

  /* ----- Pin P2[25] ----- */
  #define PINCFG_P2_25                    0 // Reserved
//#define PINCFG_P2_25                    1 // Reserved
  #define PINSET_P2_25                    1
  #define PINCLR_P2_25                    0
  #define PINDIR_P2_25                    0 // Input
  #define PINMODE_P2_25                   2 // Floating

  /* ----- Pin P2[26] ----- */
  #define PINCFG_P2_26                    0 // Reserved
//#define PINCFG_P2_26                    1 // Reserved
  #define PINSET_P2_26                    1
  #define PINCLR_P2_26                    0
  #define PINDIR_P2_26                    0 // Input
  #define PINMODE_P2_26                   2 // Floating

  /* ----- Pin P2[27] ----- */
  #define PINCFG_P2_27                    0 // Reserved
//#define PINCFG_P2_27                    1 // Reserved
  #define PINSET_P2_27                    1
  #define PINCLR_P2_27                    0
  #define PINDIR_P2_27                    0 // Input
  #define PINMODE_P2_27                   2 // Floating

  /* ----- Pin P2[28] ----- */
  #define PINCFG_P2_28                    0 // Reserved
//#define PINCFG_P2_28                    1 // Reserved
  #define PINSET_P2_28                    1
  #define PINCLR_P2_28                    0
  #define PINDIR_P2_28                    0 // Input
  #define PINMODE_P2_28                   2 // Floating

  /* ----- Pin P2[29] ----- */
  #define PINCFG_P2_29                    0 // Reserved
//#define PINCFG_P2_29                    1 // Reserved
  #define PINSET_P2_29                    1
  #define PINCLR_P2_29                    0
  #define PINDIR_P2_29                    0 // Input
  #define PINMODE_P2_29                   2 // Floating

  /* ----- Pin P2[30] ----- */
  #define PINCFG_P2_30                    0 // Reserved
//#define PINCFG_P2_30                    1 // Reserved
  #define PINSET_P2_30                    1
  #define PINCLR_P2_30                    0
  #define PINDIR_P2_30                    0 // Input
  #define PINMODE_P2_30                   2 // Floating

  /* ----- Pin P2[31] ----- */
  #define PINCFG_P2_31                    0 // Reserved
//#define PINCFG_P2_31                    1 // Reserved
  #define PINSET_P2_31                    1
  #define PINCLR_P2_31                    0
  #define PINDIR_P2_31                    0 // Input
  #define PINMODE_P2_31                   2 // Floating

/*---------------------------------------------------------------------------*
 * Port 3 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P3[0] ----- */
  #define PINCFG_P3_0                     0 // Reserved
//#define PINCFG_P3_0                     1 // Reserved
  #define PINSET_P3_0                     1
  #define PINCLR_P3_0                     0
  #define PINDIR_P3_0                     0 // Input
  #define PINMODE_P3_0                    2 // Floating

