sobczyk/bsp/csps/lpc32xx/bsps/fdi3250/startup/board/ARM9DIMM_LPC3250_pinConfig.h
  /* ----- Pin P3[1] ----- */
  #define PINCFG_P3_1                     0 // Reserved
//#define PINCFG_P3_1                     1 // Reserved
  #define PINSET_P3_1                     1
  #define PINCLR_P3_1                     0
  #define PINDIR_P3_1                     0 // Input
  #define PINMODE_P3_1                    2 // Floating

  /* ----- Pin P3[2] ----- */
  #define PINCFG_P3_2                     0 // GPO_02
//#define PINCFG_P3_2                     1 // MAT1.0
  #define PINSET_P3_2                     1
  #define PINCLR_P3_2                     0
  #define PINDIR_P3_2                     0 // Input
  #define PINMODE_P3_2                    2 // Floating

  /* ----- Pin P3[3] ----- */
  #define PINCFG_P3_3                     0 // Reserved
//#define PINCFG_P3_3                     1 // Reserved
  #define PINSET_P3_3                     1
  #define PINCLR_P3_3                     0
  #define PINDIR_P3_3                     0 // Input
  #define PINMODE_P3_3                    2 // Floating

  /* ----- Pin P3[4] ----- */
  #define PINCFG_P3_4                     0 // Reserved
//#define PINCFG_P3_4                     1 // Reserved
  #define PINSET_P3_4                     1
  #define PINCLR_P3_4                     0
  #define PINDIR_P3_4                     0 // Input
  #define PINMODE_P3_4                    2 // Floating

  /* ----- Pin P3[5] ----- */
  #define PINCFG_P3_5                     0 // Reserved
//#define PINCFG_P3_5                     1 // Reserved
  #define PINSET_P3_5                     1
  #define PINCLR_P3_5                     0
  #define PINDIR_P3_5                     0 // Input
  #define PINMODE_P3_5                    2 // Floating

  /* ----- Pin P3[6] ----- */
  #define PINCFG_P3_6                     0 // Reserved
//#define PINCFG_P3_6                     1 // Reserved
  #define PINSET_P3_6                     1
  #define PINCLR_P3_6                     0
  #define PINDIR_P3_6                     0 // Input
  #define PINMODE_P3_6                    2 // Floating

  /* ----- Pin P3[7] ----- */
  #define PINCFG_P3_7                     0 // Reserved
//#define PINCFG_P3_7                     1 // Reserved
  #define PINSET_P3_7                     1
  #define PINCLR_P3_7                     0
  #define PINDIR_P3_7                     0 // Input
  #define PINMODE_P3_7                    2 // Floating

  /* ----- Pin P3[8] ----- */
  #define PINCFG_P3_8                     0 // Reserved
//#define PINCFG_P3_8                     1 // Reserved
  #define PINSET_P3_8                     1
  #define PINCLR_P3_8                     0
  #define PINDIR_P3_8                     0 // Input
  #define PINMODE_P3_8                    2 // Floating

  /* ----- Pin P3[9] ----- */
  #define PINCFG_P3_9                     0 // Reserved
//#define PINCFG_P3_9                     1 // Reserved
  #define PINSET_P3_9                     1
  #define PINCLR_P3_9                     0
  #define PINDIR_P3_9                     0 // Input
  #define PINMODE_P3_9                    2 // Floating

  /* ----- Pin P3[10] ----- */
  #define PINCFG_P3_10                    0 // GPO_10
//#define PINCFG_P3_10                    1 // MC2B
  #define PINSET_P3_10                    1
  #define PINCLR_P3_10                    0
  #define PINDIR_P3_10                    0 // Input
  #define PINMODE_P3_10                   2 // Floating

  /* ----- Pin P3[11] ----- */
  #define PINCFG_P3_11                    0 // Reserved
//#define PINCFG_P3_11                    1 // Reserved
  #define PINSET_P3_11                    1
  #define PINCLR_P3_11                    0
  #define PINDIR_P3_11                    0 // Input
  #define PINMODE_P3_11                   2 // Floating

  /* ----- Pin P3[12] ----- */
  #define PINCFG_P3_12                    0 // GPO_12
//#define PINCFG_P3_12                    1 // MC2A
  #define PINSET_P3_12                    1
  #define PINCLR_P3_12                    0
  #define PINDIR_P3_12                    0 // Input
  #define PINMODE_P3_12                   2 // Floating

  /* ----- Pin P3[13] ----- */
  #define PINCFG_P3_13                    0 // GPO_13
//#define PINCFG_P3_13                    1 // MC1B
  #define PINSET_P3_13                    1
  #define PINCLR_P3_13                    0
  #define PINDIR_P3_13                    0 // Input
  #define PINMODE_P3_13                   2 // Floating

  /* ----- Pin P3[14] ----- */
  #define PINCFG_P3_14                    0 // Reserved
//#define PINCFG_P3_14                    1 // Reserved
  #define PINSET_P3_14                    1
  #define PINCLR_P3_14                    0
  #define PINDIR_P3_14                    0 // Input
  #define PINMODE_P3_14                   2 // Floating

  /* ----- Pin P3[15] ----- */
  #define PINCFG_P3_15                    0 // GPO_15
//#define PINCFG_P3_15                    1 // MC1A
  #define PINSET_P3_15                    1
  #define PINCLR_P3_15                    0
  #define PINDIR_P3_15                    0 // Input
  #define PINMODE_P3_15                   2 // Floating

  /* ----- Pin P3[16] ----- */
  #define PINCFG_P3_16                    0 // GPO_16
//#define PINCFG_P3_16                    1 // MC0B
  #define PINSET_P3_16                    1
  #define PINCLR_P3_16                    0
  #define PINDIR_P3_16                    0 // Input
  #define PINMODE_P3_16                   2 // Floating

  /* ----- Pin P3[17] ----- */
  #define PINCFG_P3_17                    0 // Reserved
//#define PINCFG_P3_17                    1 // Reserved
  #define PINSET_P3_17                    1
  #define PINCLR_P3_17                    0
  #define PINDIR_P3_17                    0 // Input
  #define PINMODE_P3_17                   2 // Floating

  /* ----- Pin P3[18] ----- */
  #define PINCFG_P3_18                    0 // GPO_18
//#define PINCFG_P3_18                    1 // MC0A
  #define PINSET_P3_18                    1
  #define PINCLR_P3_18                    0
  #define PINDIR_P3_18                    0 // Input
  #define PINMODE_P3_18                   2 // Floating

  /* ----- Pin P3[19] ----- */
  #define PINCFG_P3_19                    0 // Reserved
//#define PINCFG_P3_19                    1 // Reserved
  #define PINSET_P3_19                    1
  #define PINCLR_P3_19                    0
  #define PINDIR_P3_19                    0 // Input
  #define PINMODE_P3_19                   2 // Floating

