sobczyk/bsp/csps/lpc32xx/bsps/fdi3250/startup/board/ARM9DIMM_LPC3250_pinConfig.h
  /* ----- Pin P3[20] ----- */
  #define PINCFG_P3_20                    0 // Reserved
//#define PINCFG_P3_20                    1 // Reserved
  #define PINSET_P3_20                    1
  #define PINCLR_P3_20                    0
  #define PINDIR_P3_20                    0 // Input
  #define PINMODE_P3_20                   2 // Floating

  /* ----- Pin P3[21] ----- */
  #define PINCFG_P3_21                    0 // Reserved
//#define PINCFG_P3_21                    1 // Reserved
  #define PINSET_P3_21                    1
  #define PINCLR_P3_21                    0
  #define PINDIR_P3_21                    0 // Input
  #define PINMODE_P3_21                   2 // Floating

  /* ----- Pin P3[22] ----- */
  #define PINCFG_P3_22                    0 // Reserved
//#define PINCFG_P3_22                    1 // Reserved
  #define PINSET_P3_22                    1
  #define PINCLR_P3_22                    0
  #define PINDIR_P3_22                    0 // Input
  #define PINMODE_P3_22                   2 // Floating

  /* ----- Pin P3[23] ----- */
  #define PINCFG_P3_23                    0 // Reserved
//#define PINCFG_P3_23                    1 // Reserved
  #define PINSET_P3_23                    1
  #define PINCLR_P3_23                    0
  #define PINDIR_P3_23                    0 // Input
  #define PINMODE_P3_23                   2 // Floating

  /* ----- Pin P3[24] ----- */
  #define PINCFG_P3_24                    0 // Reserved
//#define PINCFG_P3_24                    1 // Reserved
  #define PINSET_P3_24                    1
  #define PINCLR_P3_24                    0
  #define PINDIR_P3_24                    0 // Input
  #define PINMODE_P3_24                   2 // Floating

  /* ----- Pin P3[25] ----- */
  #define PINCFG_P3_25                    0 // Reserved
//#define PINCFG_P3_25                    1 // Reserved
  #define PINSET_P3_25                    1
  #define PINCLR_P3_25                    0
  #define PINDIR_P3_25                    0 // Input
  #define PINMODE_P3_25                   2 // Floating

  /* ----- Pin P3[26] ----- */
  #define PINCFG_P3_26                    0 // Reserved
//#define PINCFG_P3_26                    1 // Reserved
  #define PINSET_P3_26                    1
  #define PINCLR_P3_26                    0
  #define PINDIR_P3_26                    0 // Input
  #define PINMODE_P3_26                   2 // Floating

  /* ----- Pin P3[27] ----- */
  #define PINCFG_P3_27                    0 // Reserved
//#define PINCFG_P3_27                    1 // Reserved
  #define PINSET_P3_27                    1
  #define PINCLR_P3_27                    0
  #define PINDIR_P3_27                    0 // Input
  #define PINMODE_P3_27                   2 // Floating

  /* ----- Pin P3[28] ----- */
  #define PINCFG_P3_28                    0 // Reserved
//#define PINCFG_P3_28                    1 // Reserved
  #define PINSET_P3_28                    1
  #define PINCLR_P3_28                    0
  #define PINDIR_P3_28                    0 // Input
  #define PINMODE_P3_28                   2 // Floating

  /* ----- Pin P3[29] ----- */
  #define PINCFG_P3_29                    0 // Reserved
//#define PINCFG_P3_29                    1 // Reserved
  #define PINSET_P3_29                    1
  #define PINCLR_P3_29                    0
  #define PINDIR_P3_29                    0 // Input
  #define PINMODE_P3_29                   2 // Floating

  /* ----- Pin P3[30] ----- */
  #define PINCFG_P3_30                    0 // Reserved
//#define PINCFG_P3_30                    1 // Reserved
  #define PINSET_P3_30                    1
  #define PINCLR_P3_30                    0
  #define PINDIR_P3_30                    0 // Input
  #define PINMODE_P3_30                   2 // Floating

  /* ----- Pin P3[31] ----- */
  #define PINCFG_P3_31                    0 // Reserved
//#define PINCFG_P3_31                    1 // Reserved
  #define PINSET_P3_31                    1
  #define PINCLR_P3_31                    0
  #define PINDIR_P3_31                    0 // Input
  #define PINMODE_P3_31                   2 // Floating

/*---------------------------------------------------------------------------*
 * Port 4 Configuration:
 *---------------------------------------------------------------------------*/
  /* ----- Pin P4[0] ----- */
  #define PINCFG_P4_0                     0 // Reserved
//#define PINCFG_P4_0                     1 // Reserved
  #define PINSET_P4_0                     1
  #define PINCLR_P4_0                     0
  #define PINDIR_P4_0                     0 // Input
  #define PINMODE_P4_0                    2 // Floating

  /* ----- Pin P4[1] ----- */
  #define PINCFG_P4_1                     0 // Reserved
//#define PINCFG_P4_1                     1 // Reserved
  #define PINSET_P4_1                     1
  #define PINCLR_P4_1                     0
  #define PINDIR_P4_1                     0 // Input
  #define PINMODE_P4_1                    2 // Floating

  /* ----- Pin P4[2] ----- */
  #define PINCFG_P4_2                     0 // I2S1TX_SDA
//#define PINCFG_P4_2                     1 // MAT3.1
  #define PINSET_P4_2                     1
  #define PINCLR_P4_2                     0
  #define PINDIR_P4_2                     0 // Input
  #define PINMODE_P4_2                    2 // Floating

  /* ----- Pin P4[3] ----- */
  #define PINCFG_P4_3                     0 // I2S1TX_CLK
//#define PINCFG_P4_3                     1 // MAT3.0
  #define PINSET_P4_3                     1
  #define PINCLR_P4_3                     0
  #define PINDIR_P4_3                     0 // Input
  #define PINMODE_P4_3                    2 // Floating

  /* ----- Pin P4[4] ----- */
  #define PINCFG_P4_4                     0 // I2S1TX_WS
//#define PINCFG_P4_4                     1 // CAP3.0
  #define PINSET_P4_4                     1
  #define PINCLR_P4_4                     0
  #define PINDIR_P4_4                     0 // Input
  #define PINMODE_P4_4                    2 // Floating

  /* ----- Pin P4[5] ----- */
  #define PINCFG_P4_5                     0 // SPI2_DATIO
//#define PINCFG_P4_5                     1 // MOSI1
  #define PINSET_P4_5                     1
  #define PINCLR_P4_5                     0
  #define PINDIR_P4_5                     0 // Input
  #define PINMODE_P4_5                    2 // Floating

  /* ----- Pin P4[6] ----- */
  #define PINCFG_P4_6                     0 // SPI2_DATIN
//#define PINCFG_P4_6                     1 // MISO1
  #define PINSET_P4_6                     1
  #define PINCLR_P4_6                     0
  #define PINDIR_P4_6                     0 // Input
  #define PINMODE_P4_6                    2 // Floating

  /* ----- Pin P4[7] ----- */
  #define PINCFG_P4_7                     0 // Reserved
//#define PINCFG_P4_7                     1 // Reserved
  #define PINSET_P4_7                     1
  #define PINCLR_P4_7                     0
  #define PINDIR_P4_7                     0 // Input
  #define PINMODE_P4_7                    2 // Floating

  /* ----- Pin P4[8] ----- */
  #define PINCFG_P4_8                     0 // SPI2_CLK
//#define PINCFG_P4_8                     1 // SCK1
  #define PINSET_P4_8                     1
  #define PINCLR_P4_8                     0
  #define PINDIR_P4_8                     0 // Input
  #define PINMODE_P4_8                    2 // Floating

  /* ----- Pin P4[9] ----- */
  #define PINCFG_P4_9                     0 // SPI1_DATIO
//#define PINCFG_P4_9                     1 // MOSI0 or MCFB1 if TIMCLK_CTRL[16]=1
  #define PINSET_P4_9                     1
  #define PINCLR_P4_9                     0
  #define PINDIR_P4_9                     0 // Input
  #define PINMODE_P4_9                    2 // Floating

