sobczyk/bsp/csps/lpc32xx/bsps/fdi3250/startup/board/ARM9DIMM_LPC3250_pinConfig.h
  /* ----- Pin P4[10] ----- */
  #define PINCFG_P4_10                    0 // SPI1_DATIN
//#define PINCFG_P4_10                    1 // MISO0 or MCFB2 if TIMCLK_CTRL1[6]=1
  #define PINSET_P4_10                    1
  #define PINCLR_P4_10                    0
  #define PINDIR_P4_10                    0 // Input
  #define PINMODE_P4_10                   2 // Floating

  /* ----- Pin P4[11] ----- */
  #define PINCFG_P4_11                    0 // Reserved
//#define PINCFG_P4_11                    1 // Reserved
  #define PINSET_P4_11                    1
  #define PINCLR_P4_11                    0
  #define PINDIR_P4_11                    0 // Input
  #define PINMODE_P4_11                   2 // Floating

  /* ----- Pin P4[12] ----- */
  #define PINCFG_P4_12                    0 // SPI1_CLK
//#define PINCFG_P4_12                    1 // SCK0
  #define PINSET_P4_12                    1
  #define PINCLR_P4_12                    0
  #define PINDIR_P4_12                    0 // Input
  #define PINMODE_P4_12                   2 // Floating

  /* ----- Pin P4[13] ----- */
  #define PINCFG_P4_13                    0 // Reserved
//#define PINCFG_P4_13                    1 // Reserved
  #define PINSET_P4_13                    1
  #define PINCLR_P4_13                    0
  #define PINDIR_P4_13                    0 // Input
  #define PINMODE_P4_13                   2 // Floating

  /* ----- Pin P4[14] ----- */
  #define PINCFG_P4_14                    0 // Reserved
//#define PINCFG_P4_14                    1 // Reserved
  #define PINSET_P4_14                    1
  #define PINCLR_P4_14                    0
  #define PINDIR_P4_14                    0 // Input
  #define PINMODE_P4_14                   2 // Floating

  /* ----- Pin P4[15] ----- */
  #define PINCFG_P4_15                    0 // U7_TX
//#define PINCFG_P4_15                    1 // MAT1.1
  #define PINSET_P4_15                    1
  #define PINCLR_P4_15                    0
  #define PINDIR_P4_15                    0 // Input
  #define PINMODE_P4_15                   2 // Floating

  /* ----- Pin P4[16] ----- */
  #define PINCFG_P4_16                    0 // Reserved
//#define PINCFG_P4_16                    1 // Reserved
  #define PINSET_P4_16                    1
  #define PINCLR_P4_16                    0
  #define PINDIR_P4_16                    0 // Input
  #define PINMODE_P4_16                   2 // Floating

  /* ----- Pin P4[17] ----- */
  #define PINCFG_P4_17                    0 // Reserved
//#define PINCFG_P4_17                    1 // Reserved
  #define PINSET_P4_17                    1
  #define PINCLR_P4_17                    0
  #define PINDIR_P4_17                    0 // Input
  #define PINMODE_P4_17                   2 // Floating

  /* ----- Pin P4[18] ----- */
  #define PINCFG_P4_18                    0 // Reserved
//#define PINCFG_P4_18                    1 // Reserved
  #define PINSET_P4_18                    1
  #define PINCLR_P4_18                    0
  #define PINDIR_P4_18                    0 // Input
  #define PINMODE_P4_18                   2 // Floating

  /* ----- Pin P4[19] ----- */
  #define PINCFG_P4_19                    0 // Reserved
//#define PINCFG_P4_19                    1 // Reserved
  #define PINSET_P4_19                    1
  #define PINCLR_P4_19                    0
  #define PINDIR_P4_19                    0 // Input
  #define PINMODE_P4_19                   2 // Floating

  /* ----- Pin P4[20] ----- */
  #define PINCFG_P4_20                    0 // Reserved
//#define PINCFG_P4_20                    1 // Reserved
  #define PINSET_P4_20                    1
  #define PINCLR_P4_20                    0
  #define PINDIR_P4_20                    0 // Input
  #define PINMODE_P4_20                   2 // Floating

  /* ----- Pin P4[21] ----- */
  #define PINCFG_P4_21                    0 // Reserved
//#define PINCFG_P4_21                    1 // Reserved
  #define PINSET_P4_21                    1
  #define PINCLR_P4_21                    0
  #define PINDIR_P4_21                    0 // Input
  #define PINMODE_P4_21                   2 // Floating

  /* ----- Pin P4[22] ----- */
  #define PINCFG_P4_22                    0 // Reserved
//#define PINCFG_P4_22                    1 // Reserved
  #define PINSET_P4_22                    1
  #define PINCLR_P4_22                    0
  #define PINDIR_P4_22                    0 // Input
  #define PINMODE_P4_22                   2 // Floating

  /* ----- Pin P4[23] ----- */
  #define PINCFG_P4_23                    0 // Reserved
//#define PINCFG_P4_23                    1 // Reserved
  #define PINSET_P4_23                    1
  #define PINCLR_P4_23                    0
  #define PINDIR_P4_23                    0 // Input
  #define PINMODE_P4_23                   2 // Floating

  /* ----- Pin P4[24] ----- */
  #define PINCFG_P4_24                    0 // Reserved
//#define PINCFG_P4_24                    1 // Reserved
  #define PINSET_P4_24                    1
  #define PINCLR_P4_24                    0
  #define PINDIR_P4_24                    0 // Input
  #define PINMODE_P4_24                   2 // Floating

  /* ----- Pin P4[25] ----- */
  #define PINCFG_P4_25                    0 // Reserved
//#define PINCFG_P4_25                    1 // Reserved
  #define PINSET_P4_25                    1
  #define PINCLR_P4_25                    0
  #define PINDIR_P4_25                    0 // Input
  #define PINMODE_P4_25                   2 // Floating

  /* ----- Pin P4[26] ----- */
  #define PINCFG_P4_26                    0 // Reserved
//#define PINCFG_P4_26                    1 // Reserved
  #define PINSET_P4_26                    1
  #define PINCLR_P4_26                    0
  #define PINDIR_P4_26                    0 // Input
  #define PINMODE_P4_26                   2 // Floating

  /* ----- Pin P4[27] ----- */
  #define PINCFG_P4_27                    0 // Reserved
//#define PINCFG_P4_27                    1 // Reserved
  #define PINSET_P4_27                    1
  #define PINCLR_P4_27                    0
  #define PINDIR_P4_27                    0 // Input
  #define PINMODE_P4_27                   2 // Floating

  /* ----- Pin P4[28] ----- */
  #define PINCFG_P4_28                    0 // Reserved
//#define PINCFG_P4_28                    1 // Reserved
  #define PINSET_P4_28                    1
  #define PINCLR_P4_28                    0
  #define PINDIR_P4_28                    0 // Input
  #define PINMODE_P4_28                   2 // Floating

  /* ----- Pin P4[29] ----- */
  #define PINCFG_P4_29                    0 // Reserved
//#define PINCFG_P4_29                    1 // Reserved
  #define PINSET_P4_29                    1
  #define PINCLR_P4_29                    0
  #define PINDIR_P4_29                    0 // Input
  #define PINMODE_P4_29                   2 // Floating

  /* ----- Pin P4[30] ----- */
  #define PINCFG_P4_30                    0 // Reserved
//#define PINCFG_P4_30                    1 // Reserved
  #define PINSET_P4_30                    1
  #define PINCLR_P4_30                    0
  #define PINDIR_P4_30                    0 // Input
  #define PINMODE_P4_30                   2 // Floating

  /* ----- Pin P4[31] ----- */
  #define PINCFG_P4_31                    0 // Reserved
//#define PINCFG_P4_31                    1 // Reserved
  #define PINSET_P4_31                    1
  #define PINCLR_P4_31                    0
  #define PINDIR_P4_31                    0 // Input
  #define PINMODE_P4_31                   2 // Floating

